Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF4680.PIC
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="CANSTAT_RO5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000" edc:name="CANSTAT_RO5" edc:nzwidth="0x8" edc:por="10000000" edc:_addr="0xE6E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE1_ICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE1/ICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE2_ICODE1" edc:desc="" edc:mask="0x1" edc:name="EICODE2/ICODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE3_ICODE2" edc:desc="" edc:mask="0x1" edc:name="EICODE3/ICODE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE4" edc:desc="" edc:mask="0x1" edc:name="EICODE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE0" edc:desc="" edc:mask="0x1" edc:name="OPMODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE1" edc:desc="" edc:mask="0x1" edc:name="OPMODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE2" edc:desc="" edc:mask="0x1" edc:name="OPMODE2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ICODE0" edc:desc="" edc:mask="0x1" edc:name="ICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE1" edc:desc="" edc:mask="0x1" edc:name="ICODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE2" edc:desc="" edc:mask="0x1" edc:name="ICODE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE3" edc:desc="" edc:mask="0x1" edc:name="ICODE3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE4" edc:desc="" edc:mask="0x1" edc:name="ICODE4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnsnnnr" edc:cname="CANCON_RO5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000" edc:name="CANCON_RO5" edc:nzwidth="0x8" edc:por="10000000" edc:_addr="0xE6F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FP0" edc:desc="" edc:mask="0x1" edc:name="FP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN0_FP1" edc:desc="" edc:mask="0x1" edc:name="WIN0/FP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN1_FP2" edc:desc="" edc:mask="0x1" edc:name="WIN1/FP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN2_FP3" edc:desc="" edc:mask="0x1" edc:name="WIN2/FP3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ABAT" edc:desc="" edc:mask="0x1" edc:name="ABAT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP0" edc:desc="" edc:mask="0x1" edc:name="REQOP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP1" edc:desc="" edc:mask="0x1" edc:name="REQOP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP2" edc:desc="" edc:mask="0x1" edc:name="REQOP2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="WIN0" edc:desc="" edc:mask="0x1" edc:name="WIN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN1" edc:desc="" edc:mask="0x1" edc:name="WIN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN2" edc:desc="" edc:mask="0x1" edc:name="WIN2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnrrnnnn" edc:cname="B5CON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="B5CON" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xE70">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FILHIT0_TXPRI0" edc:desc="" edc:mask="0x1" edc:name="FILHIT0/TXPRI0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT1_TXPRI1" edc:desc="" edc:mask="0x1" edc:name="FILHIT1/TXPRI1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT2_RTREN" edc:desc="" edc:mask="0x1" edc:name="FILHIT2/RTREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT3_TXREQ" edc:desc="" edc:mask="0x1" edc:name="FILHIT3/TXREQ" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT4_TXERR" edc:desc="" edc:mask="0x1" edc:name="FILHIT4/TXERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXRTRRO_TXLARB" edc:desc="" edc:mask="0x1" edc:name="RXRTRRO/TXLARB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXM1_TXABT" edc:desc="" edc:mask="0x1" edc:name="RXM1/TXABT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXFUL_TXBIF" edc:desc="" edc:mask="0x1" edc:name="RXFUL/TXBIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FILHIT0" edc:desc="" edc:mask="0x1" edc:name="FILHIT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT1" edc:desc="" edc:mask="0x1" edc:name="FILHIT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT2" edc:desc="" edc:mask="0x1" edc:name="FILHIT2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT3" edc:desc="" edc:mask="0x1" edc:name="FILHIT3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT4" edc:desc="" edc:mask="0x1" edc:name="FILHIT4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RTRRO" edc:desc="" edc:mask="0x1" edc:name="RTRRO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXM1" edc:desc="" edc:mask="0x1" edc:name="RXM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXFUL" edc:desc="" edc:mask="0x1" edc:name="RXFUL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TXPRI0" edc:desc="" edc:mask="0x1" edc:name="TXPRI0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXPRI1" edc:desc="" edc:mask="0x1" edc:name="TXPRI1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RTREN" edc:desc="" edc:mask="0x1" edc:name="RTREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXREQ" edc:desc="" edc:mask="0x1" edc:name="TXREQ" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXERR" edc:desc="" edc:mask="0x1" edc:name="TXERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXLARB" edc:desc="" edc:mask="0x1" edc:name="TXLARB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXABT" edc:desc="" edc:mask="0x1" edc:name="TXABT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXBIF" edc:desc="" edc:mask="0x1" edc:name="TXBIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="RXRTRRO" edc:desc="" edc:mask="0x1" edc:name="RXRTRRO" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="B5FILHIT0" edc:desc="" edc:mask="0x1" edc:name="B5FILHIT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5FILHIT1" edc:desc="" edc:mask="0x1" edc:name="B5FILHIT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5FILHIT2" edc:desc="" edc:mask="0x1" edc:name="B5FILHIT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5FILHIT3" edc:desc="" edc:mask="0x1" edc:name="B5FILHIT3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5FILHIT4" edc:desc="" edc:mask="0x1" edc:name="B5FILHIT4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5RTRRO" edc:desc="" edc:mask="0x1" edc:name="B5RTRRO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5RXM1" edc:desc="" edc:mask="0x1" edc:name="B5RXM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5RXFUL" edc:desc="" edc:mask="0x1" edc:name="B5RXFUL" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.1">
              <edc:SFRFieldDef edc:cname="B5TXPRI0" edc:desc="" edc:mask="0x1" edc:name="B5TXPRI0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5TXPRI1" edc:desc="" edc:mask="0x1" edc:name="B5TXPRI1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5RTREN" edc:desc="" edc:mask="0x1" edc:name="B5RTREN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5TXREQ" edc:desc="" edc:mask="0x1" edc:name="B5TXREQ" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5TXERR" edc:desc="" edc:mask="0x1" edc:name="B5TXERR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5TXLARB" edc:desc="" edc:mask="0x1" edc:name="B5TXLARB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5TXABT" edc:desc="" edc:mask="0x1" edc:name="B5TXABT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5TXBIF" edc:desc="" edc:mask="0x1" edc:name="B5TXBIF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B5SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B5SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE71">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="B5SID3" edc:desc="" edc:mask="0x1" edc:name="B5SID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5SID4" edc:desc="" edc:mask="0x1" edc:name="B5SID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5SID5" edc:desc="" edc:mask="0x1" edc:name="B5SID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5SID6" edc:desc="" edc:mask="0x1" edc:name="B5SID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5SID7" edc:desc="" edc:mask="0x1" edc:name="B5SID7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5SID8" edc:desc="" edc:mask="0x1" edc:name="B5SID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5SID9" edc:desc="" edc:mask="0x1" edc:name="B5SID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5SID10" edc:desc="" edc:mask="0x1" edc:name="B5SID10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnn-nn" edc:cname="B5SIDL" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuu-uu" edc:name="B5SIDL" edc:nzwidth="0x8" edc:por="xxxxx-xx" edc:_addr="0xE72">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXIDE" edc:desc="" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SRR" edc:desc="" edc:mask="0x1" edc:name="SRR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="EXID" edc:desc="" edc:mask="0x1" edc:name="EXID" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="EXIDEN" edc:desc="" edc:mask="0x1" edc:name="EXIDEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="B5EID16" edc:desc="" edc:mask="0x1" edc:name="B5EID16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5EID17" edc:desc="" edc:mask="0x1" edc:name="B5EID17" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="B5EXID" edc:desc="" edc:mask="0x1" edc:name="B5EXID" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5SRR" edc:desc="" edc:mask="0x1" edc:name="B5SRR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5SID0" edc:desc="" edc:mask="0x1" edc:name="B5SID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5SID1" edc:desc="" edc:mask="0x1" edc:name="B5SID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5SID2" edc:desc="" edc:mask="0x1" edc:name="B5SID2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.1">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="B5EXIDE" edc:desc="" edc:mask="0x1" edc:name="B5EXIDE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B5EIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B5EIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE73">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="B5EID8" edc:desc="" edc:mask="0x1" edc:name="B5EID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5EID9" edc:desc="" edc:mask="0x1" edc:name="B5EID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5EID10" edc:desc="" edc:mask="0x1" edc:name="B5EID10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5EID11" edc:desc="" edc:mask="0x1" edc:name="B5EID11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5EID12" edc:desc="" edc:mask="0x1" edc:name="B5EID12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5EID13" edc:desc="" edc:mask="0x1" edc:name="B5EID13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5EID14" edc:desc="" edc:mask="0x1" edc:name="B5EID14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5EID15" edc:desc="" edc:mask="0x1" edc:name="B5EID15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B5EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B5EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE74">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="B5EID0" edc:desc="" edc:mask="0x1" edc:name="B5EID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5EID1" edc:desc="" edc:mask="0x1" edc:name="B5EID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5EID2" edc:desc="" edc:mask="0x1" edc:name="B5EID2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5EID3" edc:desc="" edc:mask="0x1" edc:name="B5EID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5EID4" edc:desc="" edc:mask="0x1" edc:name="B5EID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5EID5" edc:desc="" edc:mask="0x1" edc:name="B5EID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5EID6" edc:desc="" edc:mask="0x1" edc:name="B5EID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5EID7" edc:desc="" edc:mask="0x1" edc:name="B5EID7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nrrnnnn" edc:cname="B5DLC" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="B5DLC" edc:nzwidth="0x8" edc:por="-xxxxxxx" edc:_addr="0xE75">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DLC0" edc:desc="" edc:mask="0x1" edc:name="DLC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC1" edc:desc="" edc:mask="0x1" edc:name="DLC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC2" edc:desc="" edc:mask="0x1" edc:name="DLC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC3" edc:desc="" edc:mask="0x1" edc:name="DLC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0" edc:desc="" edc:mask="0x1" edc:name="RB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB1" edc:desc="" edc:mask="0x1" edc:name="RB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXRTR_TXRTR" edc:desc="" edc:mask="0x1" edc:name="RXRTR/TXRTR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="RESRB0" edc:desc="" edc:mask="0x1" edc:name="RESRB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RESRB1" edc:desc="" edc:mask="0x1" edc:name="RESRB1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="RXRTR" edc:desc="" edc:mask="0x1" edc:name="RXRTR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="B5DLC0" edc:desc="" edc:mask="0x1" edc:name="B5DLC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5DLC1" edc:desc="" edc:mask="0x1" edc:name="B5DLC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5DLC2" edc:desc="" edc:mask="0x1" edc:name="B5DLC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5DLC3" edc:desc="" edc:mask="0x1" edc:name="B5DLC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5RB0" edc:desc="" edc:mask="0x1" edc:name="B5RB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5RB1" edc:desc="" edc:mask="0x1" edc:name="B5RB1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5RXRTR" edc:desc="" edc:mask="0x1" edc:name="B5RXRTR" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
